In [1]:
from pyspark.sql import SparkSession
import pyspark.sql.functions as F
from pyspark.sql.functions import *
import datetime
spark = SparkSession.builder.getOrCreate()

In [2]:
spark\
.read\
.option('header',True)\
.csv('/home/jovyan/usd_rub_dataset.csv')\
.createOrReplaceTempView('money_dataset')

In [3]:
#Create df
df = spark.table('money_dataset')
df.toPandas()

             Date    Price     Open     High      Low Change %
0     Apr 14 2022  80.9957  79.8675  82.3836  79.8563    1.41%
1     Apr 13 2022  79.8675  79.6800  80.2965  79.4078    0.24%
2     Apr 12 2022  79.6800  79.0650  80.2549  78.6952    0.78%
3     Apr 11 2022  79.0650  76.0800  81.2950  76.0800    3.92%
4     Apr 08 2022  76.0800  75.7500  76.2590  71.3993    0.44%
...           ...      ...      ...      ...      ...      ...
5315  Sep 20 2001  29.4300  29.4550  29.4760  29.4030   -0.08%
5316  Sep 19 2001  29.4530  29.4600  29.4810  29.4300   -0.02%
5317  Sep 18 2001  29.4600  29.4450  29.4750  29.4400   -0.00%
5318  Sep 17 2001  29.4610  29.4600  29.4730  29.4400   -0.04%
5319  Sep 14 2001  29.4730  29.3500  29.4800  29.3500   -0.00%

[5320 rows x 6 columns]

In [5]:
# Convert date
df = df\
.withColumn('new_date', F.unix_timestamp('Date', 'MMM dd yyyy').cast('timestamp'))\
.withColumn('new_price', F.col('Price').cast('double'))
df.toPandas()

,Date,Price,Open,High,Low,Change %,new_date,new_price
0,Apr 14 2022,80.9957,79.8675,82.3836,79.8563,1.41%,2022-04-14,80.9957
1,Apr 13 2022,79.8675,79.6800,80.2965,79.4078,0.24%,2022-04-13,79.8675
2,Apr 12 2022,79.6800,79.0650,80.2549,78.6952,0.78%,2022-04-12,79.6800
3,Apr 11 2022,79.0650,76.0800,81.2950,76.0800,3.92%,2022-04-11,79.0650
4,Apr 08 2022,76.0800,75.7500,76.2590,71.3993,0.44%,2022-04-08,76.0800
...,...,...,...,...,...,...,...,...
5315,Sep 20 2001,29.4300,29.4550,29.4760,29.4030,-0.08%,2001-09-20,29.4300
5316,Sep 19 2001,29.4530,29.4600,29.4810,29.4300,-0.02%,2001-09-19,29.4530
5317,Sep 18 2001,29.4600,29.4450,29.4750,29.4400,-0.00%,2001-09-18,29.4600
5318,Sep 17 2001,29.4610,29.4600,29.4730,29.4400,-0.04%,2001-09-17,29.4610
5319,Sep 14 2001,29.4730,29.3500,29.4800,29.3500,-0.00%,2001-09-14,29.4730

In [6]:
# Testing
df\
.where(month(F.col('new_date')) == '02')\
.where(year(F.col('new_date')) == '2022')\
.select(F.col('new_date'), F.col('new_price'))\
.orderBy('new_date')\
.toPandas()

     new_date  new_price
0  2022-02-01    76.8603
1  2022-02-02    76.0472
2  2022-02-03    76.5108
3  2022-02-04    75.8385
4  2022-02-07    75.4971
5  2022-02-08    75.0091
6  2022-02-09    74.7189
7  2022-02-10    75.0216
8  2022-02-11    77.1905
9  2022-02-14    76.7799
10 2022-02-15    75.3519
11 2022-02-16    75.2537
12 2022-02-17    76.3088
13 2022-02-18    77.3320
14 2022-02-21    80.0170
15 2022-02-22    78.5987
16 2022-02-23    81.1480
17 2022-02-24    84.0475
18 2022-02-25   105.2710
19 2022-02-28   106.0405

In [7]:
updated_currency = df\
.groupBy(month(F.col('new_date')).alias('month'), year(F.col('new_date')).alias('year'))\
.agg(
    F.round(F.avg(F.col('new_price')),2).alias('avg_price'),
    F.round(F.max(F.col('new_price')),2).alias('max_price'),
    F.round(F.min(F.col('new_price')),2).alias('min_price'))
updated_currency\
.orderBy(F.col('year'),F.col('month'),ascending = False)\
.show(70)

+-----+----+---------+---------+---------+
|month|year|avg_price|max_price|min_price|
+-----+----+---------+---------+---------+
|    4|2022|    80.24|     84.0|    75.75|
|    3|2022|   106.45|    143.0|     83.2|
|    2|2022|    79.94|   106.04|    74.72|
|    1|2022|    76.62|     79.5|    74.47|
|   12|2021|    73.85|    74.65|    73.31|
|   11|2021|    72.94|    75.61|    70.72|
|   10|2021|     71.3|    72.73|    69.54|
|    9|2021|    72.88|    73.46|    72.29|
|    8|2021|    73.59|    74.26|    72.95|
|    7|2021|    73.97|    74.77|    73.14|
|    6|2021|     72.6|    73.51|    71.77|
|    5|2021|     73.9|    74.86|    73.16|
|    4|2021|    76.06|     77.4|    74.41|
|    3|2021|    74.53|    76.58|    72.82|
|    2|2021|    74.39|    76.22|    73.32|
|    1|2021|     74.4|    75.96|    73.22|
|   12|2020|    74.06|     75.9|    72.86|
|   11|2020|    76.75|    80.54|    75.47|
|   10|2020|    77.63|    79.53|    76.12|
|    9|2020|    76.09|    79.07|    73.58|
|    8|2020|     73.8|     75.4|    72.86|
|    7|2020|    71.59|    74.41|    70.57|
|    6|2020|     69.3|    71.17|     68.2|
|    5|2020|    72.55|    74.82|    70.14|
|    4|2020|    75.02|    78.73|     73.0|
|    3|2020|    74.61|    80.87|    65.99|
|    2|2020|     64.1|    66.88|    62.89|
|    1|2020|    61.96|    63.92|    61.05|
|   12|2019|    62.87|    64.17|    61.85|
|   11|2019|    63.89|    64.35|    63.49|
|   10|2019|    64.33|    65.26|    63.72|
|    9|2019|    64.93|     66.8|    63.85|
|    8|2019|    65.84|     66.9|    64.35|
|    7|2019|    63.24|     63.9|    62.66|
|    6|2019|    64.05|    65.38|    62.58|
|    5|2019|    64.91|    65.44|    64.39|
|    4|2019|    64.55|    65.48|    63.69|
|    3|2019|     65.1|    66.28|    63.86|
|    2|2019|    65.85|    66.65|    65.39|
|    1|2019|    66.54|    68.66|    65.41|
|   12|2018|    67.58|    69.83|    66.23|
|   11|2018|    66.56|    68.11|    65.54|
|   10|2018|    65.86|    67.01|    64.98|
|    9|2018|    67.63|    70.56|    65.55|
|    8|2018|    66.48|    68.24|    63.04|
|    7|2018|    62.82|    63.66|    61.74|
|    6|2018|     62.8|    63.87|    61.78|
|    5|2018|    62.25|    64.01|    61.21|
|    4|2018|    60.93|    63.04|    57.44|
|    3|2018|    57.13|    57.83|    56.42|
|    2|2018|    56.87|    58.42|    55.71|
|    1|2018|    56.56|    57.26|    55.92|
|   12|2017|    58.57|     59.3|    57.52|
|   11|2017|     59.0|    60.23|    58.16|
|   10|2017|    57.75|    58.35|    57.17|
|    9|2017|    57.68|     58.2|     56.9|
|    8|2017|    59.44|    60.58|    58.01|
|    7|2017|    59.67|    60.73|    58.93|
|    6|2017|    58.13|    60.31|     56.4|
|    5|2017|    56.97|    58.37|    56.35|
|    4|2017|     56.5|    57.25|    55.84|
|    3|2017|    57.79|     59.3|    56.09|
|    2|2017|    58.41|    60.13|    57.13|
|    1|2017|    59.83|    60.91|    59.25|
|   12|2016|    61.92|    63.98|    60.33|
|   11|2016|    64.43|    66.02|    63.32|
|   10|2016|    62.61|    63.38|    61.99|
|    9|2016|    64.38|    65.92|    62.83|
|    8|2016|    64.92|     66.9|    63.66|
|    7|2016|     64.4|     66.6|    62.83|
+-----+----+---------+---------+---------+
only showing top 70 rows